export function isWarrant(symbol: string): boolean {
  const rules = [
    /^0[3-8][0-9][0-9][0-9][0-9]$/, // 上市國內標的認購權證
    /^0[3-8][0-9][0-9][0-9]P$/,     // 上市國內標的認售權證
    /^0[3-8][0-9][0-9][0-9]F$/,     // 上市外國標的認購權證
    /^0[3-8][0-9][0-9][0-9]Q$/,     // 上市外國標的認售權證
    /^0[3-8][0-9][0-9][0-9]C$/,     // 上市國內標的下限型認購權證
    /^0[3-8][0-9][0-9][0-9]B$/,     // 上市國內標的上限型認售權證
    /^0[3-8][0-9][0-9][0-9]X$/,     // 上市國內標的可展延下限型認購權證
    /^0[3-8][0-9][0-9][0-9]Y$/,     // 上市國內標的可展延上限型認售權證
    /^7[0-3][0-9][0-9][0-9][0-9]$/, // 上櫃國內標的認購權證
    /^7[0-3][0-9][0-9][0-9]P$/,     // 上櫃國內標的認售權證
    /^7[0-3][0-9][0-9][0-9]F$/,     // 上櫃外國標的認購權證
    /^7[0-3][0-9][0-9][0-9]Q$/,     // 上櫃外國標的認售權證
    /^7[0-3][0-9][0-9][0-9]C$/,     // 上櫃國內標的下限型認購權證
    /^7[0-3][0-9][0-9][0-9]B$/,     // 上櫃國內標的上限型認售權證
    /^7[0-3][0-9][0-9][0-9]X$/,     // 上櫃國內標的可展延下限型認購權證
    /^7[0-3][0-9][0-9][0-9]Y$/,     // 上櫃國內標的可展延上限型認售權證
  ]
  return rules.some(regex => regex.test(symbol));
}
